In [1]:
'''
Análise de Dados e Big Data
Manipulação de DataSet
Coeficiente de Pierce
'''

'\nAnálise de Dados e Big Data\nManipulação de DataSet\n'

In [22]:
#importacao de bibliotecas

import numpy as np
import pandas as pd

In [3]:
labels = 'a b c'.split()
minha_lista = [10 ,20, 30]
arr = np.array([10., 20, 30])
d = {
    'a': 10,
    'b': 20,
    'c': 30
}

In [5]:
response = pd.Series(data = minha_lista)
print(response)

0    10
1    20
2    30
dtype: int64

In [7]:
response_2 = pd.Series(
    data = minha_lista,
    index = labels
)
print(response_2)

a    10
b    20
c    30
dtype: int64

In [12]:
serie1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'ALE', 'USSR', 'JP'])
serie2 = pd.Series([1, 2, 5, 4], index = ['EUA', 'ALE', 'CHN', 'JP'])

In [17]:
serie1.get('bra'.upper() ,'ERROR')

'ERROR'

In [19]:
serie3 = serie1 + serie2

In [20]:
serie3.get('EUA')

2.0

In [21]:
type(serie3.get('EUA'))

numpy.float64

In [23]:
matrix = np.random.randn(5,4)
print(matrix)

[[-0.74260502  0.02241341  0.29084763  1.8776675 ]
 [ 0.94810215  0.03647969 -0.01984208 -0.6106118 ]
 [ 0.28330595  0.785333    0.52982992 -1.10331124]
 [-0.34458485  0.73526285  1.99454075 -1.7652977 ]
 [ 0.91968125 -1.93014801 -0.15879085 -0.09810276]]

In [24]:
df = pd.DataFrame(matrix,
                  index = 'A B C D E'.split(),
                  columns = 'W X Y Z'.split()
                 )

In [26]:
df

          W         X         Y         Z
A -0.742605  0.022413  0.290848  1.877668
B  0.948102  0.036480 -0.019842 -0.610612
C  0.283306  0.785333  0.529830 -1.103311
D -0.344585  0.735263  1.994541 -1.765298
E  0.919681 -1.930148 -0.158791 -0.098103

In [31]:
df[['Y', 'Z']]

          Y         Z
A  0.290848  1.877668
B -0.019842 -0.610612
C  0.529830 -1.103311
D  1.994541 -1.765298
E -0.158791 -0.098103

In [37]:
df['Nova'] = df['W'] + df['Y']

In [39]:
df.drop('C', axis = 0)

          W         X         Y         Z      Nova
A -0.742605  0.022413  0.290848  1.877668 -0.451757
B  0.948102  0.036480 -0.019842 -0.610612  0.928260
D -0.344585  0.735263  1.994541 -1.765298  1.649956
E  0.919681 -1.930148 -0.158791 -0.098103  0.760890

In [42]:
df

          W         X         Y         Z      Nova
A -0.742605  0.022413  0.290848  1.877668 -0.451757
B  0.948102  0.036480 -0.019842 -0.610612  0.928260
C  0.283306  0.785333  0.529830 -1.103311  0.813136
D -0.344585  0.735263  1.994541 -1.765298  1.649956
E  0.919681 -1.930148 -0.158791 -0.098103  0.760890

In [44]:
df.drop('Nova', axis = 1, inplace = True)
df

          W         X         Y         Z
A -0.742605  0.022413  0.290848  1.877668
B  0.948102  0.036480 -0.019842 -0.610612
C  0.283306  0.785333  0.529830 -1.103311
D -0.344585  0.735263  1.994541 -1.765298
E  0.919681 -1.930148 -0.158791 -0.098103

In [45]:
df_1 = df.copy()
df_1

          W         X         Y         Z
A -0.742605  0.022413  0.290848  1.877668
B  0.948102  0.036480 -0.019842 -0.610612
C  0.283306  0.785333  0.529830 -1.103311
D -0.344585  0.735263  1.994541 -1.765298
E  0.919681 -1.930148 -0.158791 -0.098103

In [50]:
df.loc['A'] #pega os valores da linha

W   -0.742605
X    0.022413
Y    0.290848
Z    1.877668
Name: A, dtype: float64

In [51]:
df.iloc[0] #pega os valores da linha

W   -0.742605
X    0.022413
Y    0.290848
Z    1.877668
Name: A, dtype: float64

In [52]:
df.loc['B', 'Y'] #procura por um valor especifico; ordem  = linha, coluna

-0.019842080262659524

In [53]:
df.loc[['A', 'B'], ['W', 'Y']] #extrair um dataframe de outro dataframe. sempre na ordem linha coluna

          W         Y
A -0.742605  0.290848
B  0.948102 -0.019842

In [54]:
df_1

          W         X         Y         Z
A -0.742605  0.022413  0.290848  1.877668
B  0.948102  0.036480 -0.019842 -0.610612
C  0.283306  0.785333  0.529830 -1.103311
D -0.344585  0.735263  1.994541 -1.765298
E  0.919681 -1.930148 -0.158791 -0.098103

In [58]:
df[df_1>0] #exibir os maiores que zero. o q nao eh ele retorna nan

          W         X         Y         Z
A       NaN  0.022413  0.290848  1.877668
B  0.948102  0.036480       NaN       NaN
C  0.283306  0.785333  0.529830       NaN
D       NaN  0.735263  1.994541       NaN
E  0.919681       NaN       NaN       NaN

In [60]:
df_1[df_1['X']>0] #dataframe onde a coluna x eh maior que zero. ele corta as linhas onde a condicao e falsa

          W         X         Y         Z
A -0.742605  0.022413  0.290848  1.877668
B  0.948102  0.036480 -0.019842 -0.610612
C  0.283306  0.785333  0.529830 -1.103311
D -0.344585  0.735263  1.994541 -1.765298

In [61]:
df_1[df_1['X']>0]['Z']
'''
#dataframe onde a coluna x eh maior que zero.
ele corta as linhas onde a condicao e falsa.
retorna os resultados na coluna z
'''

A    1.877668
B   -0.610612
C   -1.103311
D   -1.765298
Name: Z, dtype: float64

In [63]:
df_1[df_1['X']>0][['X', 'Z']]

          X         Z
A  0.022413  1.877668
B  0.036480 -0.610612
C  0.785333 -1.103311
D  0.735263 -1.765298

In [66]:
df_1[(df_1['W']>0) & (df['Y'])]

          W         X         Y         Z
B  0.948102  0.036480 -0.019842 -0.610612
C  0.283306  0.785333  0.529830 -1.103311
E  0.919681 -1.930148 -0.158791 -0.098103

In [69]:
conditional1 = (df_1['W'] > 0)
conditional2 = (df_1['Y'] > 0)
df_1[conditional1 & conditional2]

          W         X        Y         Z
C  0.283306  0.785333  0.52983 -1.103311

In [70]:
df_1.reset_index()

  index         W         X         Y         Z
0     A -0.742605  0.022413  0.290848  1.877668
1     B  0.948102  0.036480 -0.019842 -0.610612
2     C  0.283306  0.785333  0.529830 -1.103311
3     D -0.344585  0.735263  1.994541 -1.765298
4     E  0.919681 -1.930148 -0.158791 -0.098103

In [ ]:
novo_indice = 'ca qa sw de fr'.upper().split()
df_1.set_index('new column')